adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
extern volatile PIMMISCSTR _PIMMISC @0x0000020A;
#define PIMMISC                         _PIMMISC.Byte
#define PIMMISC_CALCLKEN                _PIMMISC.Bits.CALCLKEN

#define PIMMISC_CALCLKEN_MASK           1U


/*** PTAB - Port AB Data Register; 0x00000220 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PTA - Port A Data Register; 0x00000220 ***/
    union {
      byte Byte;
      struct {
        byte PTA0        :1;                                       /* Port A general purpose I/O data 0 */
        byte PTA1        :1;                                       /* Port A general purpose I/O data 1 */
        byte PTA2        :1;                                       /* Port A general purpose I/O data 2 */
        byte PTA3        :1;                                       /* Port A general purpose I/O data 3 */
        byte PTA4        :1;                                       /* Port A general purpose I/O data 4 */
        byte PTA5        :1;                                       /* Port A general purpose I/O data 5 */
        byte PTA6        :1;                                       /* Port A general purpose I/O data 6 */
        byte PTA7        :1;                                       /* Port A general purpose I/O data 7 */
      } Bits;
    } PTASTR;
    #define PTA                         _PTAB.Overlap_STR.PTASTR.Byte
    #define PTA_PTA0                    _PTAB.Overlap_STR.PTASTR.Bits.PTA0
    #define PTA_PTA1                    _PTAB.Overlap_STR.PTASTR.Bits.PTA1
    #define PTA_PTA2                    _PTAB.Overlap_STR.PTASTR.Bits.PTA2
    #define PTA_PTA3                    _PTAB.Overlap_STR.PTASTR.Bits.PTA3
    #define PTA_PTA4                    _PTAB.Overlap_STR.PTASTR.Bits.PTA4
    #define PTA_PTA5                    _PTAB.Overlap_STR.PTASTR.Bits.PTA5
    #define PTA_PTA6                    _PTAB.Overlap_STR.PTASTR.Bits.PTA6
    #define PTA_PTA7                    _PTAB.Overlap_STR.PTASTR.Bits.PTA7
    
    #define PTA_PTA0_MASK               1U
    #define PTA_PTA1_MASK               2U
    #define PTA_PTA2_MASK               4U
    #define PTA_PTA3_MASK               8U
    #define PTA_PTA4_MASK               16U
    #define PTA_PTA5_MASK               32U
    #define PTA_PTA6_MASK               64U
    #define PTA_PTA7_MASK               128U
    

    /*** PTB - Port B Data Register; 0x00000221 ***/
    union {
      byte Byte;
      struct {
        byte PTB0        :1;                                       /* Port B general purpose I/O data 0 */
        byte PTB1        :1;                                       /* Port B general purpose I/O data 1 */
        byte PTB2        :1;                                       /* Port B general purpose I/O data 2 */
        byte PTB3        :1;                                       /* Port B general purpose I/O data 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPTB :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PTBSTR;
    #define PTB                         _PTAB.Overlap_STR.PTBSTR.Byte
    #define PTB_PTB0                    _PTAB.Overlap_STR.PTBSTR.Bits.PTB0
    #define PTB_PTB1                    _PTAB.Overlap_STR.PTBSTR.Bits.PTB1
    #define PTB_PTB2                    _PTAB.Overlap_STR.PTBSTR.Bits.PTB2
    #define PTB_PTB3                    _PTAB.Overlap_STR.PTBSTR.Bits.PTB3
    #define PTB_PTB                     _PTAB.Overlap_STR.PTBSTR.MergedBits.grpPTB
    
    #define PTB_PTB0_MASK               1U
    #define PTB_PTB1_MASK               2U
    #define PTB_PTB2_MASK               4U
    #define PTB_PTB3_MASK               8U
    #define PTB_PTB_MASK                15U
    #define PTB_PTB_BITNUM              0U
    
  } Overlap_STR;

  struct {
    word PTB0        :1;                                       /* Port AB general purpose I/O data 0 */
    word PTB1        :1;                                       /* Port AB general purpose I/O data 1 */
    word PTB2        :1;                                       /* Port AB general purpose I/O data 2 */
    word PTB3        :1;                                       /* Port AB general purpose I/O data 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word PTA0        :1;                                       /* Port AB general purpose I/O data 8 */
    word PTA1        :1;                                       /* Port AB general purpose I/O data 9 */
    word PTA2        :1;                                       /* Port AB general purpose I/O data 10 */
    word PTA3        :1;                                       /* Port AB general purpose I/O data 11 */
    word PTA4        :1;                                       /* Port AB general purpose I/O data 12 */
    word PTA5        :1;                                       /* Port AB general purpose I/O data 13 */
    word PTA6        :1;                                       /* Port AB general purpose I/O data 14 */
    word PTA7        :1;                                       /* Port AB general purpose I/O data 15 */
  } Bits;
  struct {
    word grpPTB  :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpPTA  :8;
  } MergedBits;
} PTABSTR;
extern volatile PTABSTR _PTAB @0x00000220;
#define PTAB                            _PTAB.Word
#define PTAB_PTB0                       _PTAB.Bits.PTB0
#define PTAB_PTB1                       _PTAB.Bits.PTB1
#define PTAB_PTB2                       _PTAB.Bits.PTB2
#define PTAB_PTB3                       _PTAB.Bits.PTB3
#define PTAB_PTA0                       _PTAB.Bits.PTA0
#define PTAB_PTA1                       _PTAB.Bits.PTA1
#define PTAB_PTA2                       _PTAB.Bits.PTA2
#define PTAB_PTA3                       _PTAB.Bits.PTA3
#define PTAB_PTA4                       _PTAB.Bits.PTA4
#define PTAB_PTA5                       _PTAB.Bits.PTA5
#define PTAB_PTA6                       _PTAB.Bits.PTA6
#define PTAB_PTA7                       _PTAB.Bits.PTA7
#define PTAB_PTB                        _PTAB.MergedBits.grpPTB
#define PTAB_PTA                        _PTAB.MergedBits.grpPTA

#define PTAB_PTB0_MASK                  1U
#define PTAB_PTB1_MASK                  2U
#define PTAB_PTB2_MASK                  4U
#define PTAB_PTB3_MASK                  8U
#define PTAB_PTA0_MASK                  256U
#define PTAB_PTA1_MASK                  512U
#define PTAB_PTA2_MASK                  1024U
#define PTAB_PTA3_MASK                  2048U
#define PTAB_PTA4_MASK                  4096U
#define PTAB_PTA5_MASK                  8192U
#define PTAB_PTA6_MASK                  16384U
#define PTAB_PTA7_MASK                  32768U
#define PTAB_PTB_MASK                   15U
#define PTAB_PTB_BITNUM                 0U
#define PTAB_PTA_MASK                   65280U
#define PTAB_PTA_BITNUM                 8U


