adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
    #define PPSA_PPSA0_MASK             1U
    #define PPSA_PPSA1_MASK             2U
    #define PPSA_PPSA2_MASK             4U
    #define PPSA_PPSA3_MASK             8U
    #define PPSA_PPSA4_MASK             16U
    #define PPSA_PPSA5_MASK             32U
    #define PPSA_PPSA6_MASK             64U
    #define PPSA_PPSA7_MASK             128U
    

    /*** PPSB - Port B Polarity Select Register; 0x00000229 ***/
    union {
      byte Byte;
      struct {
        byte PPSB0       :1;                                       /* Port B pull polarity select 0 */
        byte PPSB1       :1;                                       /* Port B pull polarity select 1 */
        byte PPSB2       :1;                                       /* Port B pull polarity select 2 */
        byte PPSB3       :1;                                       /* Port B pull polarity select 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPPSB :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PPSBSTR;
    #define PPSB                        _PPSAB.Overlap_STR.PPSBSTR.Byte
    #define PPSB_PPSB0                  _PPSAB.Overlap_STR.PPSBSTR.Bits.PPSB0
    #define PPSB_PPSB1                  _PPSAB.Overlap_STR.PPSBSTR.Bits.PPSB1
    #define PPSB_PPSB2                  _PPSAB.Overlap_STR.PPSBSTR.Bits.PPSB2
    #define PPSB_PPSB3                  _PPSAB.Overlap_STR.PPSBSTR.Bits.PPSB3
    #define PPSB_PPSB                   _PPSAB.Overlap_STR.PPSBSTR.MergedBits.grpPPSB
    
    #define PPSB_PPSB0_MASK             1U
    #define PPSB_PPSB1_MASK             2U
    #define PPSB_PPSB2_MASK             4U
    #define PPSB_PPSB3_MASK             8U
    #define PPSB_PPSB_MASK              15U
    #define PPSB_PPSB_BITNUM            0U
    
  } Overlap_STR;

  struct {
    word PPSB0       :1;                                       /* Port AB pull polarity select 0 */
    word PPSB1       :1;                                       /* Port AB pull polarity select 1 */
    word PPSB2       :1;                                       /* Port AB pull polarity select 2 */
    word PPSB3       :1;                                       /* Port AB pull polarity select 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word PPSA0       :1;                                       /* Port AB pull polarity select 0 */
    word PPSA1       :1;                                       /* Port AB pull polarity select 1 */
    word PPSA2       :1;                                       /* Port AB pull polarity select 2 */
    word PPSA3       :1;                                       /* Port AB pull polarity select 3 */
    word PPSA4       :1;                                       /* Port AB pull polarity select 4 */
    word PPSA5       :1;                                       /* Port AB pull polarity select 5 */
    word PPSA6       :1;                                       /* Port AB pull polarity select 6 */
    word PPSA7       :1;                                       /* Port AB pull polarity select 7 */
  } Bits;
  struct {
    word grpPPSB :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word grpPPSA :8;
  } MergedBits;
} PPSABSTR;
extern volatile PPSABSTR _PPSAB @0x00000228;
#define PPSAB                           _PPSAB.Word
#define PPSAB_PPSB0                     _PPSAB.Bits.PPSB0
#define PPSAB_PPSB1                     _PPSAB.Bits.PPSB1
#define PPSAB_PPSB2                     _PPSAB.Bits.PPSB2
#define PPSAB_PPSB3                     _PPSAB.Bits.PPSB3
#define PPSAB_PPSA0                     _PPSAB.Bits.PPSA0
#define PPSAB_PPSA1                     _PPSAB.Bits.PPSA1
#define PPSAB_PPSA2                     _PPSAB.Bits.PPSA2
#define PPSAB_PPSA3                     _PPSAB.Bits.PPSA3
#define PPSAB_PPSA4                     _PPSAB.Bits.PPSA4
#define PPSAB_PPSA5                     _PPSAB.Bits.PPSA5
#define PPSAB_PPSA6                     _PPSAB.Bits.PPSA6
#define PPSAB_PPSA7                     _PPSAB.Bits.PPSA7
#define PPSAB_PPSB                      _PPSAB.MergedBits.grpPPSB
#define PPSAB_PPSA                      _PPSAB.MergedBits.grpPPSA

#define PPSAB_PPSB0_MASK                1U
#define PPSAB_PPSB1_MASK                2U
#define PPSAB_PPSB2_MASK                4U
#define PPSAB_PPSB3_MASK                8U
#define PPSAB_PPSA0_MASK                256U
#define PPSAB_PPSA1_MASK                512U
#define PPSAB_PPSA2_MASK                1024U
#define PPSAB_PPSA3_MASK                2048U
#define PPSAB_PPSA4_MASK                4096U
#define PPSAB_PPSA5_MASK                8192U
#define PPSAB_PPSA6_MASK                16384U
#define PPSAB_PPSA7_MASK                32768U
#define PPSAB_PPSB_MASK                 15U
#define PPSAB_PPSB_BITNUM               0U
#define PPSAB_PPSA_MASK                 65280U
#define PPSAB_PPSA_BITNUM               8U


/*** WOMA - Port A Wired-Or Mode Register; 0x0000023E ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte WOMA2       :1;                                       /* Port A wired-or mode 2 */
    byte WOMA3       :1;                                       /* Port A wired-or mode 3 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpWOMA_2 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} WOMASTR;
extern volatile WOMASTR _WOMA @0x0000023E;
#define WOMA                            _WOMA.Byte
#define WOMA_WOMA2                      _WOMA.Bits.WOMA2
#define WOMA_WOMA3                      _WOMA.Bits.WOMA3
#define WOMA_WOMA_2                     _WOMA.MergedBits.grpWOMA_2

#define WOMA_WOMA2_MASK                 4U
#define WOMA_WOMA3_MASK                 8U
#define WOMA_WOMA_2_MASK                12U
#define WOMA_WOMA_2_BITNUM              2U


/*** PTCD - Port CD Data Register; 0x00000240 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PTC - Port C Data Register; 0x00000240 ***/
    union {
      byte Byte;
      struct {
        byte PTC0        :1;                                       /* Port C general purpose I/O data 0 */
        byte PTC1        :1;                                       /* Port C general purpose I/O data 1 */
        byte PTC2        :1;                                       /* Port C general purpose I/O data 2 */
        byte PTC3        :1;                                       /* Port C general purpose I/O data 3 */
        byte PTC4        :1;                                       /* Port C general purpose I/O data 4 */
        byte PTC5        :1;                                       /* Port C general purpose I/O data 5 */
        byte PTC6        :1;                                       /* Port C general purpose I/O data 6 */
        byte PTC7        :1;                                       /* Port C general purpose I/O data 7 */
      } Bits;
    } PTCSTR;
    #define PTC                         _PTCD.Overlap_STR.PTCSTR.Byte
    #define PTC_PTC0                    _PTCD.Overlap_STR.PTCSTR.Bits.PTC0
    #define PTC_PTC1                    _PTCD.Overlap_STR.PTCSTR.Bits.PTC1
    #define PTC_PTC2                    _PTCD.Overlap_STR.PTCSTR.Bits.PTC2
    #define PTC_PTC3                    _PTCD.Overlap_STR.PTCSTR.Bits.PTC3
    #define PTC_PTC4                    _PTCD.Overlap_STR.PTCSTR.Bits.PTC4
    #define PTC_PTC5                    _PTCD.Overlap_STR.PTCSTR.Bits.PTC5
    #define PTC_PTC6                    _PTCD.Overlap_STR.PTCSTR.Bits.PTC6
    #define PTC_PTC7                    _PTCD.Overlap_STR.PTCSTR.Bits.PTC7
    
    #define PTC_PTC0_MASK               1U
    #define PTC_PTC1_MASK               2U
    #define PTC_PTC2_MASK               4U
    #define PTC_PTC3_MASK               8U
    #define PTC_PTC4_MASK               16U
    #define PTC_PTC5_MASK               32U
    #define PTC_PTC6_MASK               64U
    #define PTC_PTC7_MASK               128U
    

    /*** PTD - Port D Data Register; 0x00000241 ***/
    union {
      byte Byte;
      struct {
        byte PTD0        :1;                                       /* Port D general purpose I/O data 0 */
        byte PTD1        :1;                                       /* Port D general purpose I/O data 1 */
        byte PTD2        :1;                                       /* Port D general purpose I/O data 2 */
        byte PTD3        :1;                                       /* Port D general purpose I/O data 3 */
        byte PTD4        :1;                                       /* Port D general purpose I/O data 4 */
        byte PTD5        :1;                                       /* Port D general purpose I/O data 5 */
        byte PTD6        :1;                                       /* Port D general purpose I/O data 6 */
        byte PTD7        :1;                                       /* Port D general purpose I/O data 7 */
      } Bits;
    } PTDSTR;
    #define PTD                         _PTCD.Overlap_STR.PTDSTR.Byte
    #define PTD_PTD0                    _PTCD.Overlap_STR.PTDSTR.Bits.PTD0
    #define PTD_PTD1                    _PTCD.Overlap_STR.PTDSTR.Bits.PTD1
    #define PTD_PTD2                    _PTCD.Overlap_STR.PTDSTR.Bits.PTD2
    #define PTD_PTD3                    _PTCD.Overlap_STR.PTDSTR.Bits.PTD3
    #define PTD_PTD4                    _PTCD.Overlap_STR.PTDSTR.Bits.PTD4
    #define PTD_PTD5                    _PTCD.Overlap_STR.PTDSTR.Bits.PTD5
    #define PTD_PTD6                    _PTCD.Overlap_STR.PTDSTR.Bits.PTD6
    #define PTD_PTD7                    _PTCD.Overlap_STR.PTDSTR.Bits.PTD7
    
    #define PTD_PTD0_MASK               1U
    #define PTD_PTD1_MASK               2U
    #define PTD_PTD2_MASK               4U
    #define PTD_PTD3_MASK               8U
    #define PTD_PTD4_MASK               16U
    #define PTD_PTD5_MASK               32U
    #define PTD_PTD6_MASK               64U
    #define PTD_PTD7_MASK               128U
    
  } Overlap_STR;

