adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
    #define DDRD_DDRD0_MASK             1U
    #define DDRD_DDRD1_MASK             2U
    #define DDRD_DDRD2_MASK             4U
    #define DDRD_DDRD3_MASK             8U
    #define DDRD_DDRD4_MASK             16U
    #define DDRD_DDRD5_MASK             32U
    #define DDRD_DDRD6_MASK             64U
    #define DDRD_DDRD7_MASK             128U
    
  } Overlap_STR;

  struct {
    word DDRD0       :1;                                       /* Port CD data direction select 0 */
    word DDRD1       :1;                                       /* Port CD data direction select 1 */
    word DDRD2       :1;                                       /* Port CD data direction select 2 */
    word DDRD3       :1;                                       /* Port CD data direction select 3 */
    word DDRD4       :1;                                       /* Port CD data direction select 4 */
    word DDRD5       :1;                                       /* Port CD data direction select 5 */
    word DDRD6       :1;                                       /* Port CD data direction select 6 */
    word DDRD7       :1;                                       /* Port CD data direction select 7 */
    word DDRC0       :1;                                       /* Port CD data direction select 8 */
    word DDRC1       :1;                                       /* Port CD data direction select 9 */
    word DDRC2       :1;                                       /* Port CD data direction select 10 */
    word DDRC3       :1;                                       /* Port CD data direction select 11 */
    word DDRC4       :1;                                       /* Port CD data direction select 12 */
    word DDRC5       :1;                                       /* Port CD data direction select 13 */
    word DDRC6       :1;                                       /* Port CD data direction select 14 */
    word DDRC7       :1;                                       /* Port CD data direction select 15 */
  } Bits;
  struct {
    word grpDDRD :8;
    word grpDDRC :8;
  } MergedBits;
} DDRCDSTR;
extern volatile DDRCDSTR _DDRCD @0x00000244;
#define DDRCD                           _DDRCD.Word
#define DDRCD_DDRD0                     _DDRCD.Bits.DDRD0
#define DDRCD_DDRD1                     _DDRCD.Bits.DDRD1
#define DDRCD_DDRD2                     _DDRCD.Bits.DDRD2
#define DDRCD_DDRD3                     _DDRCD.Bits.DDRD3
#define DDRCD_DDRD4                     _DDRCD.Bits.DDRD4
#define DDRCD_DDRD5                     _DDRCD.Bits.DDRD5
#define DDRCD_DDRD6                     _DDRCD.Bits.DDRD6
#define DDRCD_DDRD7                     _DDRCD.Bits.DDRD7
#define DDRCD_DDRC0                     _DDRCD.Bits.DDRC0
#define DDRCD_DDRC1                     _DDRCD.Bits.DDRC1
#define DDRCD_DDRC2                     _DDRCD.Bits.DDRC2
#define DDRCD_DDRC3                     _DDRCD.Bits.DDRC3
#define DDRCD_DDRC4                     _DDRCD.Bits.DDRC4
#define DDRCD_DDRC5                     _DDRCD.Bits.DDRC5
#define DDRCD_DDRC6                     _DDRCD.Bits.DDRC6
#define DDRCD_DDRC7                     _DDRCD.Bits.DDRC7
#define DDRCD_DDRD                      _DDRCD.MergedBits.grpDDRD
#define DDRCD_DDRC                      _DDRCD.MergedBits.grpDDRC

#define DDRCD_DDRD0_MASK                1U
#define DDRCD_DDRD1_MASK                2U
#define DDRCD_DDRD2_MASK                4U
#define DDRCD_DDRD3_MASK                8U
#define DDRCD_DDRD4_MASK                16U
#define DDRCD_DDRD5_MASK                32U
#define DDRCD_DDRD6_MASK                64U
#define DDRCD_DDRD7_MASK                128U
#define DDRCD_DDRC0_MASK                256U
#define DDRCD_DDRC1_MASK                512U
#define DDRCD_DDRC2_MASK                1024U
#define DDRCD_DDRC3_MASK                2048U
#define DDRCD_DDRC4_MASK                4096U
#define DDRCD_DDRC5_MASK                8192U
#define DDRCD_DDRC6_MASK                16384U
#define DDRCD_DDRC7_MASK                32768U
#define DDRCD_DDRD_MASK                 255U
#define DDRCD_DDRD_BITNUM               0U
#define DDRCD_DDRC_MASK                 65280U
#define DDRCD_DDRC_BITNUM               8U


/*** PERCD - Port CD Pull Up Enable Register; 0x00000246 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PERC - Port C Pull Device Enable Register; 0x00000246 ***/
    union {
      byte Byte;
      struct {
        byte PERC0       :1;                                       /* Port C pull device enable 0 */
        byte PERC1       :1;                                       /* Port C pull device enable 1 */
        byte PERC2       :1;                                       /* Port C pull device enable 2 */
        byte PERC3       :1;                                       /* Port C pull device enable 3 */
        byte PERC4       :1;                                       /* Port C pull device enable 4 */
        byte PERC5       :1;                                       /* Port C pull device enable 5 */
        byte PERC6       :1;                                       /* Port C pull device enable 6 */
        byte PERC7       :1;                                       /* Port C pull device enable 7 */
      } Bits;
    } PERCSTR;
    #define PERC                        _PERCD.Overlap_STR.PERCSTR.Byte
    #define PERC_PERC0                  _PERCD.Overlap_STR.PERCSTR.Bits.PERC0
    #define PERC_PERC1                  _PERCD.Overlap_STR.PERCSTR.Bits.PERC1
    #define PERC_PERC2                  _PERCD.Overlap_STR.PERCSTR.Bits.PERC2
    #define PERC_PERC3                  _PERCD.Overlap_STR.PERCSTR.Bits.PERC3
    #define PERC_PERC4                  _PERCD.Overlap_STR.PERCSTR.Bits.PERC4
    #define PERC_PERC5                  _PERCD.Overlap_STR.PERCSTR.Bits.PERC5
    #define PERC_PERC6                  _PERCD.Overlap_STR.PERCSTR.Bits.PERC6
    #define PERC_PERC7                  _PERCD.Overlap_STR.PERCSTR.Bits.PERC7
    
    #define PERC_PERC0_MASK             1U
    #define PERC_PERC1_MASK             2U
    #define PERC_PERC2_MASK             4U
    #define PERC_PERC3_MASK             8U
    #define PERC_PERC4_MASK             16U
    #define PERC_PERC5_MASK             32U
    #define PERC_PERC6_MASK             64U
    #define PERC_PERC7_MASK             128U
    

    /*** PERD - Port D Pull Device Enable Register; 0x00000247 ***/
    union {
      byte Byte;
      struct {
        byte PERD0       :1;                                       /* Port D pull device enable 0 */
        byte PERD1       :1;                                       /* Port D pull device enable 1 */
        byte PERD2       :1;                                       /* Port D pull device enable 2 */
        byte PERD3       :1;                                       /* Port D pull device enable 3 */
        byte PERD4       :1;                                       /* Port D pull device enable 4 */
        byte PERD5       :1;                                       /* Port D pull device enable 5 */
        byte PERD6       :1;                                       /* Port D pull device enable 6 */
        byte PERD7       :1;                                       /* Port D pull device enable 7 */
      } Bits;
    } PERDSTR;
    #define PERD                        _PERCD.Overlap_STR.PERDSTR.Byte
    #define PERD_PERD0                  _PERCD.Overlap_STR.PERDSTR.Bits.PERD0
    #define PERD_PERD1                  _PERCD.Overlap_STR.PERDSTR.Bits.PERD1
    #define PERD_PERD2                  _PERCD.Overlap_STR.PERDSTR.Bits.PERD2
    #define PERD_PERD3                  _PERCD.Overlap_STR.PERDSTR.Bits.PERD3
    #define PERD_PERD4                  _PERCD.Overlap_STR.PERDSTR.Bits.PERD4
    #define PERD_PERD5                  _PERCD.Overlap_STR.PERDSTR.Bits.PERD5
    #define PERD_PERD6                  _PERCD.Overlap_STR.PERDSTR.Bits.PERD6
    #define PERD_PERD7                  _PERCD.Overlap_STR.PERDSTR.Bits.PERD7
    
