adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
  struct {
    word PTF0        :1;                                       /* Port EF general purpose I/O data 0 */
    word PTF1        :1;                                       /* Port EF general purpose I/O data 1 */
    word PTF2        :1;                                       /* Port EF general purpose I/O data 2 */
    word PTF3        :1;                                       /* Port EF general purpose I/O data 3 */
    word PTF4        :1;                                       /* Port EF general purpose I/O data 4 */
    word PTF5        :1;                                       /* Port EF general purpose I/O data 5 */
    word PTF6        :1;                                       /* Port EF general purpose I/O data 6 */
    word PTF7        :1;                                       /* Port EF general purpose I/O data 7 */
    word PTE0        :1;                                       /* Port EF general purpose I/O data 8 */
    word PTE1        :1;                                       /* Port EF general purpose I/O data 9 */
    word PTE2        :1;                                       /* Port EF general purpose I/O data 10 */
    word PTE3        :1;                                       /* Port EF general purpose I/O data 11 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpPTF  :8;
    word grpPTE  :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} PTEFSTR;
extern volatile PTEFSTR _PTEF @0x00000260;
#define PTEF                            _PTEF.Word
#define PTEF_PTF0                       _PTEF.Bits.PTF0
#define PTEF_PTF1                       _PTEF.Bits.PTF1
#define PTEF_PTF2                       _PTEF.Bits.PTF2
#define PTEF_PTF3                       _PTEF.Bits.PTF3
#define PTEF_PTF4                       _PTEF.Bits.PTF4
#define PTEF_PTF5                       _PTEF.Bits.PTF5
#define PTEF_PTF6                       _PTEF.Bits.PTF6
#define PTEF_PTF7                       _PTEF.Bits.PTF7
#define PTEF_PTE0                       _PTEF.Bits.PTE0
#define PTEF_PTE1                       _PTEF.Bits.PTE1
#define PTEF_PTE2                       _PTEF.Bits.PTE2
#define PTEF_PTE3                       _PTEF.Bits.PTE3
#define PTEF_PTF                        _PTEF.MergedBits.grpPTF
#define PTEF_PTE                        _PTEF.MergedBits.grpPTE

#define PTEF_PTF0_MASK                  1U
#define PTEF_PTF1_MASK                  2U
#define PTEF_PTF2_MASK                  4U
#define PTEF_PTF3_MASK                  8U
#define PTEF_PTF4_MASK                  16U
#define PTEF_PTF5_MASK                  32U
#define PTEF_PTF6_MASK                  64U
#define PTEF_PTF7_MASK                  128U
#define PTEF_PTE0_MASK                  256U
#define PTEF_PTE1_MASK                  512U
#define PTEF_PTE2_MASK                  1024U
#define PTEF_PTE3_MASK                  2048U
#define PTEF_PTF_MASK                   255U
#define PTEF_PTF_BITNUM                 0U
#define PTEF_PTE_MASK                   3840U
#define PTEF_PTE_BITNUM                 8U


/*** PTIEF - Port EF Input Register; 0x00000262 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PTIE - Port E Input Register; 0x00000262 ***/
    union {
      byte Byte;
      struct {
        byte PTIE0       :1;                                       /* Port E data input 0 */
        byte PTIE1       :1;                                       /* Port E data input 1 */
        byte PTIE2       :1;                                       /* Port E data input 2 */
        byte PTIE3       :1;                                       /* Port E data input 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPTIE :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PTIESTR;
    #define PTIE                        _PTIEF.Overlap_STR.PTIESTR.Byte
    #define PTIE_PTIE0                  _PTIEF.Overlap_STR.PTIESTR.Bits.PTIE0
    #define PTIE_PTIE1                  _PTIEF.Overlap_STR.PTIESTR.Bits.PTIE1
    #define PTIE_PTIE2                  _PTIEF.Overlap_STR.PTIESTR.Bits.PTIE2
    #define PTIE_PTIE3                  _PTIEF.Overlap_STR.PTIESTR.Bits.PTIE3
    #define PTIE_PTIE                   _PTIEF.Overlap_STR.PTIESTR.MergedBits.grpPTIE
    
    #define PTIE_PTIE0_MASK             1U
    #define PTIE_PTIE1_MASK             2U
    #define PTIE_PTIE2_MASK             4U
    #define PTIE_PTIE3_MASK             8U
    #define PTIE_PTIE_MASK              15U
    #define PTIE_PTIE_BITNUM            0U
    

    /*** PTIF - Port F Input Register; 0x00000263 ***/
    union {
      byte Byte;
      struct {
        byte PTIF0       :1;                                       /* Port F data input 0 */
        byte PTIF1       :1;                                       /* Port F data input 1 */
        byte PTIF2       :1;                                       /* Port F data input 2 */
        byte PTIF3       :1;                                       /* Port F data input 3 */
        byte PTIF4       :1;                                       /* Port F data input 4 */
        byte PTIF5       :1;                                       /* Port F data input 5 */
        byte PTIF6       :1;                                       /* Port F data input 6 */
        byte PTIF7       :1;                                       /* Port F data input 7 */
      } Bits;
    } PTIFSTR;
    #define PTIF                        _PTIEF.Overlap_STR.PTIFSTR.Byte
    #define PTIF_PTIF0                  _PTIEF.Overlap_STR.PTIFSTR.Bits.PTIF0
    #define PTIF_PTIF1                  _PTIEF.Overlap_STR.PTIFSTR.Bits.PTIF1
    #define PTIF_PTIF2                  _PTIEF.Overlap_STR.PTIFSTR.Bits.PTIF2
    #define PTIF_PTIF3                  _PTIEF.Overlap_STR.PTIFSTR.Bits.PTIF3
    #define PTIF_PTIF4                  _PTIEF.Overlap_STR.PTIFSTR.Bits.PTIF4
    #define PTIF_PTIF5                  _PTIEF.Overlap_STR.PTIFSTR.Bits.PTIF5
    #define PTIF_PTIF6                  _PTIEF.Overlap_STR.PTIFSTR.Bits.PTIF6
    #define PTIF_PTIF7                  _PTIEF.Overlap_STR.PTIFSTR.Bits.PTIF7
    
    #define PTIF_PTIF0_MASK             1U
    #define PTIF_PTIF1_MASK             2U
    #define PTIF_PTIF2_MASK             4U
    #define PTIF_PTIF3_MASK             8U
    #define PTIF_PTIF4_MASK             16U
    #define PTIF_PTIF5_MASK             32U
    #define PTIF_PTIF6_MASK             64U
    #define PTIF_PTIF7_MASK             128U
    
  } Overlap_STR;

