adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
  struct {
    word PTIF0       :1;                                       /* Port EF data input 0 */
    word PTIF1       :1;                                       /* Port EF data input 1 */
    word PTIF2       :1;                                       /* Port EF data input 2 */
    word PTIF3       :1;                                       /* Port EF data input 3 */
    word PTIF4       :1;                                       /* Port EF data input 4 */
    word PTIF5       :1;                                       /* Port EF data input 5 */
    word PTIF6       :1;                                       /* Port EF data input 6 */
    word PTIF7       :1;                                       /* Port EF data input 7 */
    word PTIE0       :1;                                       /* Port EF data input 0 */
    word PTIE1       :1;                                       /* Port EF data input 1 */
    word PTIE2       :1;                                       /* Port EF data input 2 */
    word PTIE3       :1;                                       /* Port EF data input 3 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpPTIF :8;
    word grpPTIE :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} PTIEFSTR;
extern volatile PTIEFSTR _PTIEF @0x00000262;
#define PTIEF                           _PTIEF.Word
#define PTIEF_PTIF0                     _PTIEF.Bits.PTIF0
#define PTIEF_PTIF1                     _PTIEF.Bits.PTIF1
#define PTIEF_PTIF2                     _PTIEF.Bits.PTIF2
#define PTIEF_PTIF3                     _PTIEF.Bits.PTIF3
#define PTIEF_PTIF4                     _PTIEF.Bits.PTIF4
#define PTIEF_PTIF5                     _PTIEF.Bits.PTIF5
#define PTIEF_PTIF6                     _PTIEF.Bits.PTIF6
#define PTIEF_PTIF7                     _PTIEF.Bits.PTIF7
#define PTIEF_PTIE0                     _PTIEF.Bits.PTIE0
#define PTIEF_PTIE1                     _PTIEF.Bits.PTIE1
#define PTIEF_PTIE2                     _PTIEF.Bits.PTIE2
#define PTIEF_PTIE3                     _PTIEF.Bits.PTIE3
#define PTIEF_PTIF                      _PTIEF.MergedBits.grpPTIF
#define PTIEF_PTIE                      _PTIEF.MergedBits.grpPTIE

#define PTIEF_PTIF0_MASK                1U
#define PTIEF_PTIF1_MASK                2U
#define PTIEF_PTIF2_MASK                4U
#define PTIEF_PTIF3_MASK                8U
#define PTIEF_PTIF4_MASK                16U
#define PTIEF_PTIF5_MASK                32U
#define PTIEF_PTIF6_MASK                64U
#define PTIEF_PTIF7_MASK                128U
#define PTIEF_PTIE0_MASK                256U
#define PTIEF_PTIE1_MASK                512U
#define PTIEF_PTIE2_MASK                1024U
#define PTIEF_PTIE3_MASK                2048U
#define PTIEF_PTIF_MASK                 255U
#define PTIEF_PTIF_BITNUM               0U
#define PTIEF_PTIE_MASK                 3840U
#define PTIEF_PTIE_BITNUM               8U


/*** DDREF - Port EF Data Direction Register; 0x00000264 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** DDRE - Port E Data Direction Register; 0x00000264 ***/
    union {
      byte Byte;
      struct {
        byte DDRE0       :1;                                       /* Port E data direction select 0 */
        byte DDRE1       :1;                                       /* Port E data direction select 1 */
        byte DDRE2       :1;                                       /* Port E data direction select 2 */
        byte DDRE3       :1;                                       /* Port E data direction select 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpDDRE :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } DDRESTR;
    #define DDRE                        _DDREF.Overlap_STR.DDRESTR.Byte
    #define DDRE_DDRE0                  _DDREF.Overlap_STR.DDRESTR.Bits.DDRE0
    #define DDRE_DDRE1                  _DDREF.Overlap_STR.DDRESTR.Bits.DDRE1
    #define DDRE_DDRE2                  _DDREF.Overlap_STR.DDRESTR.Bits.DDRE2
    #define DDRE_DDRE3                  _DDREF.Overlap_STR.DDRESTR.Bits.DDRE3
    #define DDRE_DDRE                   _DDREF.Overlap_STR.DDRESTR.MergedBits.grpDDRE
    
    #define DDRE_DDRE0_MASK             1U
    #define DDRE_DDRE1_MASK             2U
    #define DDRE_DDRE2_MASK             4U
    #define DDRE_DDRE3_MASK             8U
    #define DDRE_DDRE_MASK              15U
    #define DDRE_DDRE_BITNUM            0U
    

    /*** DDRF - Port F Data Direction Register; 0x00000265 ***/
    union {
      byte Byte;
      struct {
        byte DDRF0       :1;                                       /* Port F data direction select 0 */
        byte DDRF1       :1;                                       /* Port F data direction select 1 */
        byte DDRF2       :1;                                       /* Port F data direction select 2 */
        byte DDRF3       :1;                                       /* Port F data direction select 3 */
        byte DDRF4       :1;                                       /* Port F data direction select 4 */
        byte DDRF5       :1;                                       /* Port F data direction select 5 */
        byte DDRF6       :1;                                       /* Port F data direction select 6 */
        byte DDRF7       :1;                                       /* Port F data direction select 7 */
      } Bits;
    } DDRFSTR;
    #define DDRF                        _DDREF.Overlap_STR.DDRFSTR.Byte
    #define DDRF_DDRF0                  _DDREF.Overlap_STR.DDRFSTR.Bits.DDRF0
    #define DDRF_DDRF1                  _DDREF.Overlap_STR.DDRFSTR.Bits.DDRF1
    #define DDRF_DDRF2                  _DDREF.Overlap_STR.DDRFSTR.Bits.DDRF2
    #define DDRF_DDRF3                  _DDREF.Overlap_STR.DDRFSTR.Bits.DDRF3
    #define DDRF_DDRF4                  _DDREF.Overlap_STR.DDRFSTR.Bits.DDRF4
    #define DDRF_DDRF5                  _DDREF.Overlap_STR.DDRFSTR.Bits.DDRF5
    #define DDRF_DDRF6                  _DDREF.Overlap_STR.DDRFSTR.Bits.DDRF6
    #define DDRF_DDRF7                  _DDREF.Overlap_STR.DDRFSTR.Bits.DDRF7
    
    #define DDRF_DDRF0_MASK             1U
    #define DDRF_DDRF1_MASK             2U
    #define DDRF_DDRF2_MASK             4U
    #define DDRF_DDRF3_MASK             8U
    #define DDRF_DDRF4_MASK             16U
    #define DDRF_DDRF5_MASK             32U
    #define DDRF_DDRF6_MASK             64U
    #define DDRF_DDRF7_MASK             128U
    
  } Overlap_STR;

