adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
  struct {
    word PERF0       :1;                                       /* Port EF pull device enable 0 */
    word PERF1       :1;                                       /* Port EF pull device enable 1 */
    word PERF2       :1;                                       /* Port EF pull device enable 2 */
    word PERF3       :1;                                       /* Port EF pull device enable 3 */
    word PERF4       :1;                                       /* Port EF pull device enable 4 */
    word PERF5       :1;                                       /* Port EF pull device enable 5 */
    word PERF6       :1;                                       /* Port EF pull device enable 6 */
    word PERF7       :1;                                       /* Port EF pull device enable 7 */
    word PERE0       :1;                                       /* Port EF pull device enable 8 */
    word PERE1       :1;                                       /* Port EF pull device enable 9 */
    word PERE2       :1;                                       /* Port EF pull device enable 10 */
    word PERE3       :1;                                       /* Port EF pull device enable 11 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpPERF :8;
    word grpPERE :4;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} PEREFSTR;
extern volatile PEREFSTR _PEREF @0x00000266;
#define PEREF                           _PEREF.Word
#define PEREF_PERF0                     _PEREF.Bits.PERF0
#define PEREF_PERF1                     _PEREF.Bits.PERF1
#define PEREF_PERF2                     _PEREF.Bits.PERF2
#define PEREF_PERF3                     _PEREF.Bits.PERF3
#define PEREF_PERF4                     _PEREF.Bits.PERF4
#define PEREF_PERF5                     _PEREF.Bits.PERF5
#define PEREF_PERF6                     _PEREF.Bits.PERF6
#define PEREF_PERF7                     _PEREF.Bits.PERF7
#define PEREF_PERE0                     _PEREF.Bits.PERE0
#define PEREF_PERE1                     _PEREF.Bits.PERE1
#define PEREF_PERE2                     _PEREF.Bits.PERE2
#define PEREF_PERE3                     _PEREF.Bits.PERE3
#define PEREF_PERF                      _PEREF.MergedBits.grpPERF
#define PEREF_PERE                      _PEREF.MergedBits.grpPERE

#define PEREF_PERF0_MASK                1U
#define PEREF_PERF1_MASK                2U
#define PEREF_PERF2_MASK                4U
#define PEREF_PERF3_MASK                8U
#define PEREF_PERF4_MASK                16U
#define PEREF_PERF5_MASK                32U
#define PEREF_PERF6_MASK                64U
#define PEREF_PERF7_MASK                128U
#define PEREF_PERE0_MASK                256U
#define PEREF_PERE1_MASK                512U
#define PEREF_PERE2_MASK                1024U
#define PEREF_PERE3_MASK                2048U
#define PEREF_PERF_MASK                 255U
#define PEREF_PERF_BITNUM               0U
#define PEREF_PERE_MASK                 3840U
#define PEREF_PERE_BITNUM               8U


/*** PPSEF - Port EF Polarity Select Register; 0x00000268 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PPSE - Port E Polarity Select Register; 0x00000268 ***/
    union {
      byte Byte;
      struct {
        byte PPSE0       :1;                                       /* Port E pull polarity select 0 */
        byte PPSE1       :1;                                       /* Port E pull polarity select 1 */
        byte PPSE2       :1;                                       /* Port E pull polarity select 2 */
        byte PPSE3       :1;                                       /* Port E pull polarity select 3 */
        byte             :1; 
        byte             :1; 
        byte             :1; 
        byte             :1; 
      } Bits;
      struct {
        byte grpPPSE :4;
        byte     :1;
        byte     :1;
        byte     :1;
        byte     :1;
      } MergedBits;
    } PPSESTR;
    #define PPSE                        _PPSEF.Overlap_STR.PPSESTR.Byte
    #define PPSE_PPSE0                  _PPSEF.Overlap_STR.PPSESTR.Bits.PPSE0
    #define PPSE_PPSE1                  _PPSEF.Overlap_STR.PPSESTR.Bits.PPSE1
    #define PPSE_PPSE2                  _PPSEF.Overlap_STR.PPSESTR.Bits.PPSE2
    #define PPSE_PPSE3                  _PPSEF.Overlap_STR.PPSESTR.Bits.PPSE3
    #define PPSE_PPSE                   _PPSEF.Overlap_STR.PPSESTR.MergedBits.grpPPSE
    
    #define PPSE_PPSE0_MASK             1U
    #define PPSE_PPSE1_MASK             2U
    #define PPSE_PPSE2_MASK             4U
    #define PPSE_PPSE3_MASK             8U
    #define PPSE_PPSE_MASK              15U
    #define PPSE_PPSE_BITNUM            0U
    

    /*** PPSF - Port F Polarity Select Register; 0x00000269 ***/
    union {
      byte Byte;
      struct {
        byte PPSF0       :1;                                       /* Port F pull polarity select 0 */
        byte PPSF1       :1;                                       /* Port F pull polarity select 1 */
        byte PPSF2       :1;                                       /* Port F pull polarity select 2 */
        byte PPSF3       :1;                                       /* Port F pull polarity select 3 */
        byte PPSF4       :1;                                       /* Port F pull polarity select 4 */
        byte PPSF5       :1;                                       /* Port F pull polarity select 5 */
        byte PPSF6       :1;                                       /* Port F pull polarity select 6 */
        byte PPSF7       :1;                                       /* Port F pull polarity select 7 */
      } Bits;
    } PPSFSTR;
    #define PPSF                        _PPSEF.Overlap_STR.PPSFSTR.Byte
    #define PPSF_PPSF0                  _PPSEF.Overlap_STR.PPSFSTR.Bits.PPSF0
    #define PPSF_PPSF1                  _PPSEF.Overlap_STR.PPSFSTR.Bits.PPSF1
    #define PPSF_PPSF2                  _PPSEF.Overlap_STR.PPSFSTR.Bits.PPSF2
    #define PPSF_PPSF3                  _PPSEF.Overlap_STR.PPSFSTR.Bits.PPSF3
    #define PPSF_PPSF4                  _PPSEF.Overlap_STR.PPSFSTR.Bits.PPSF4
    #define PPSF_PPSF5                  _PPSEF.Overlap_STR.PPSFSTR.Bits.PPSF5
    #define PPSF_PPSF6                  _PPSEF.Overlap_STR.PPSFSTR.Bits.PPSF6
    #define PPSF_PPSF7                  _PPSEF.Overlap_STR.PPSFSTR.Bits.PPSF7
    
    #define PPSF_PPSF0_MASK             1U
    #define PPSF_PPSF1_MASK             2U
    #define PPSF_PPSF2_MASK             4U
    #define PPSF_PPSF3_MASK             8U
    #define PPSF_PPSF4_MASK             16U
    #define PPSF_PPSF5_MASK             32U
    #define PPSF_PPSF6_MASK             64U
    #define PPSF_PPSF7_MASK             128U
    
  } Overlap_STR;

