adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
extern volatile PIFADLSTR _PIFADL @0x0000028F;
#define PIFADL                          _PIFADL.Byte
#define PIFADL_PIFADL0                  _PIFADL.Bits.PIFADL0
#define PIFADL_PIFADL1                  _PIFADL.Bits.PIFADL1
#define PIFADL_PIFADL2                  _PIFADL.Bits.PIFADL2
#define PIFADL_PIFADL3                  _PIFADL.Bits.PIFADL3
#define PIFADL_PIFADL4                  _PIFADL.Bits.PIFADL4
#define PIFADL_PIFADL5                  _PIFADL.Bits.PIFADL5
#define PIFADL_PIFADL6                  _PIFADL.Bits.PIFADL6
#define PIFADL_PIFADL7                  _PIFADL.Bits.PIFADL7

#define PIFADL_PIFADL0_MASK             1U
#define PIFADL_PIFADL1_MASK             2U
#define PIFADL_PIFADL2_MASK             4U
#define PIFADL_PIFADL3_MASK             8U
#define PIFADL_PIFADL4_MASK             16U
#define PIFADL_PIFADL5_MASK             32U
#define PIFADL_PIFADL6_MASK             64U
#define PIFADL_PIFADL7_MASK             128U


/*** DIENADL - Digital Input Enable Register; 0x00000299 ***/
typedef union {
  byte Byte;
  struct {
    byte DIENADL0    :1;                                       /* Digital input enable 0 */
    byte DIENADL1    :1;                                       /* Digital input enable 1 */
    byte DIENADL2    :1;                                       /* Digital input enable 2 */
    byte DIENADL3    :1;                                       /* Digital input enable 3 */
    byte DIENADL4    :1;                                       /* Digital input enable 4 */
    byte DIENADL5    :1;                                       /* Digital input enable 5 */
    byte DIENADL6    :1;                                       /* Digital input enable 6 */
    byte DIENADL7    :1;                                       /* Digital input enable 7 */
  } Bits;
} DIENADLSTR;
extern volatile DIENADLSTR _DIENADL @0x00000299;
#define DIENADL                         _DIENADL.Byte
#define DIENADL_DIENADL0                _DIENADL.Bits.DIENADL0
#define DIENADL_DIENADL1                _DIENADL.Bits.DIENADL1
#define DIENADL_DIENADL2                _DIENADL.Bits.DIENADL2
#define DIENADL_DIENADL3                _DIENADL.Bits.DIENADL3
#define DIENADL_DIENADL4                _DIENADL.Bits.DIENADL4
#define DIENADL_DIENADL5                _DIENADL.Bits.DIENADL5
#define DIENADL_DIENADL6                _DIENADL.Bits.DIENADL6
#define DIENADL_DIENADL7                _DIENADL.Bits.DIENADL7

#define DIENADL_DIENADL0_MASK           1U
#define DIENADL_DIENADL1_MASK           2U
#define DIENADL_DIENADL2_MASK           4U
#define DIENADL_DIENADL3_MASK           8U
#define DIENADL_DIENADL4_MASK           16U
#define DIENADL_DIENADL5_MASK           32U
#define DIENADL_DIENADL6_MASK           64U
#define DIENADL_DIENADL7_MASK           128U


/*** PTT - Port T Data Register; 0x000002C0 ***/
typedef union {
  byte Byte;
  struct {
    byte PTT0        :1;                                       /* Port T general purpose I/O data 0 */
    byte PTT1        :1;                                       /* Port T general purpose I/O data 1 */
    byte PTT2        :1;                                       /* Port T general purpose I/O data 2 */
    byte PTT3        :1;                                       /* Port T general purpose I/O data 3 */
    byte PTT4        :1;                                       /* Port T general purpose I/O data 4 */
    byte PTT5        :1;                                       /* Port T general purpose I/O data 5 */
    byte PTT6        :1;                                       /* Port T general purpose I/O data 6 */
    byte PTT7        :1;                                       /* Port T general purpose I/O data 7 */
  } Bits;
} PTTSTR;
extern volatile PTTSTR _PTT @0x000002C0;
#define PTT                             _PTT.Byte
#define PTT_PTT0                        _PTT.Bits.PTT0
#define PTT_PTT1                        _PTT.Bits.PTT1
#define PTT_PTT2                        _PTT.Bits.PTT2
#define PTT_PTT3                        _PTT.Bits.PTT3
#define PTT_PTT4                        _PTT.Bits.PTT4
#define PTT_PTT5                        _PTT.Bits.PTT5
#define PTT_PTT6                        _PTT.Bits.PTT6
#define PTT_PTT7                        _PTT.Bits.PTT7

#define PTT_PTT0_MASK                   1U
#define PTT_PTT1_MASK                   2U
#define PTT_PTT2_MASK                   4U
#define PTT_PTT3_MASK                   8U
#define PTT_PTT4_MASK                   16U
#define PTT_PTT5_MASK                   32U
#define PTT_PTT6_MASK                   64U
#define PTT_PTT7_MASK                   128U


/*** PTIT - Port T Input Register; 0x000002C1 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIT0       :1;                                       /* Port T data input 0 */
    byte PTIT1       :1;                                       /* Port T data input 1 */
    byte PTIT2       :1;                                       /* Port T data input 2 */
    byte PTIT3       :1;                                       /* Port T data input 3 */
    byte PTIT4       :1;                                       /* Port T data input 4 */
    byte PTIT5       :1;                                       /* Port T data input 5 */
    byte PTIT6       :1;                                       /* Port T data input 6 */
    byte PTIT7       :1;                                       /* Port T data input 7 */
  } Bits;
} PTITSTR;
extern volatile PTITSTR _PTIT @0x000002C1;
#define PTIT                            _PTIT.Byte
#define PTIT_PTIT0                      _PTIT.Bits.PTIT0
#define PTIT_PTIT1                      _PTIT.Bits.PTIT1
#define PTIT_PTIT2                      _PTIT.Bits.PTIT2
#define PTIT_PTIT3                      _PTIT.Bits.PTIT3
#define PTIT_PTIT4                      _PTIT.Bits.PTIT4
#define PTIT_PTIT5                      _PTIT.Bits.PTIT5
#define PTIT_PTIT6                      _PTIT.Bits.PTIT6
#define PTIT_PTIT7                      _PTIT.Bits.PTIT7

#define PTIT_PTIT0_MASK                 1U
#define PTIT_PTIT1_MASK                 2U
#define PTIT_PTIT2_MASK                 4U
#define PTIT_PTIT3_MASK                 8U
#define PTIT_PTIT4_MASK                 16U
#define PTIT_PTIT5_MASK                 32U
#define PTIT_PTIT6_MASK                 64U
#define PTIT_PTIT7_MASK                 128U


