adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
/*** TIM1TCTL1 - Timer Control Register 1; 0x00000408 ***/
typedef union {
  byte Byte;
  struct {
    byte OL4         :1;                                       /* Output Level Bit 4 */
    byte OM4         :1;                                       /* Output Mode Bit 4 */
    byte OL5         :1;                                       /* Output Level Bit 5 */
    byte OM5         :1;                                       /* Output Mode Bit 5 */
    byte OL6         :1;                                       /* Output Level Bit 6 */
    byte OM6         :1;                                       /* Output Mode Bit 6 */
    byte OL7         :1;                                       /* Output Level Bit 7 */
    byte OM7         :1;                                       /* Output Mode Bit 7 */
  } Bits;
} TIM1TCTL1STR;
extern volatile TIM1TCTL1STR _TIM1TCTL1 @0x00000408;
#define TIM1TCTL1                       _TIM1TCTL1.Byte
#define TIM1TCTL1_OL4                   _TIM1TCTL1.Bits.OL4
#define TIM1TCTL1_OM4                   _TIM1TCTL1.Bits.OM4
#define TIM1TCTL1_OL5                   _TIM1TCTL1.Bits.OL5
#define TIM1TCTL1_OM5                   _TIM1TCTL1.Bits.OM5
#define TIM1TCTL1_OL6                   _TIM1TCTL1.Bits.OL6
#define TIM1TCTL1_OM6                   _TIM1TCTL1.Bits.OM6
#define TIM1TCTL1_OL7                   _TIM1TCTL1.Bits.OL7
#define TIM1TCTL1_OM7                   _TIM1TCTL1.Bits.OM7

#define TIM1TCTL1_OL4_MASK              1U
#define TIM1TCTL1_OM4_MASK              2U
#define TIM1TCTL1_OL5_MASK              4U
#define TIM1TCTL1_OM5_MASK              8U
#define TIM1TCTL1_OL6_MASK              16U
#define TIM1TCTL1_OM6_MASK              32U
#define TIM1TCTL1_OL7_MASK              64U
#define TIM1TCTL1_OM7_MASK              128U


/*** TIM1TCTL2 - Timer Control Register 2; 0x00000409 ***/
typedef union {
  byte Byte;
  struct {
    byte OL0         :1;                                       /* Output Level Bit 0 */
    byte OM0         :1;                                       /* Output Mode Bit 0 */
    byte OL1         :1;                                       /* Output Level Bit 1 */
    byte OM1         :1;                                       /* Output Mode Bit 1 */
    byte OL2         :1;                                       /* Output Level Bit 2 */
    byte OM2         :1;                                       /* Output Mode Bit 2 */
    byte OL3         :1;                                       /* Output Level Bit 3 */
    byte OM3         :1;                                       /* Output Mode Bit 3 */
  } Bits;
} TIM1TCTL2STR;
extern volatile TIM1TCTL2STR _TIM1TCTL2 @0x00000409;
#define TIM1TCTL2                       _TIM1TCTL2.Byte
#define TIM1TCTL2_OL0                   _TIM1TCTL2.Bits.OL0
#define TIM1TCTL2_OM0                   _TIM1TCTL2.Bits.OM0
#define TIM1TCTL2_OL1                   _TIM1TCTL2.Bits.OL1
#define TIM1TCTL2_OM1                   _TIM1TCTL2.Bits.OM1
#define TIM1TCTL2_OL2                   _TIM1TCTL2.Bits.OL2
#define TIM1TCTL2_OM2                   _TIM1TCTL2.Bits.OM2
#define TIM1TCTL2_OL3                   _TIM1TCTL2.Bits.OL3
#define TIM1TCTL2_OM3                   _TIM1TCTL2.Bits.OM3

#define TIM1TCTL2_OL0_MASK              1U
#define TIM1TCTL2_OM0_MASK              2U
#define TIM1TCTL2_OL1_MASK              4U
#define TIM1TCTL2_OM1_MASK              8U
#define TIM1TCTL2_OL2_MASK              16U
#define TIM1TCTL2_OM2_MASK              32U
#define TIM1TCTL2_OL3_MASK              64U
#define TIM1TCTL2_OM3_MASK              128U


/*** TIM1TCTL3 - Timer Control Register 3; 0x0000040A ***/
typedef union {
  byte Byte;
  struct {
    byte EDG4A       :1;                                       /* Input Capture Edge Control 4A */
    byte EDG4B       :1;                                       /* Input Capture Edge Control 4B */
    byte EDG5A       :1;                                       /* Input Capture Edge Control 5A */
    byte EDG5B       :1;                                       /* Input Capture Edge Control 5B */
    byte EDG6A       :1;                                       /* Input Capture Edge Control 6A */
    byte EDG6B       :1;                                       /* Input Capture Edge Control 6B */
    byte EDG7A       :1;                                       /* Input Capture Edge Control 7A */
    byte EDG7B       :1;                                       /* Input Capture Edge Control 7B */
  } Bits;
  struct {
    byte grpEDG4x :2;
    byte grpEDG5x :2;
    byte grpEDG6x :2;
    byte grpEDG7x :2;
  } MergedBits;
} TIM1TCTL3STR;
extern volatile TIM1TCTL3STR _TIM1TCTL3 @0x0000040A;
#define TIM1TCTL3                       _TIM1TCTL3.Byte
#define TIM1TCTL3_EDG4A                 _TIM1TCTL3.Bits.EDG4A
#define TIM1TCTL3_EDG4B                 _TIM1TCTL3.Bits.EDG4B
#define TIM1TCTL3_EDG5A                 _TIM1TCTL3.Bits.EDG5A
#define TIM1TCTL3_EDG5B                 _TIM1TCTL3.Bits.EDG5B
#define TIM1TCTL3_EDG6A                 _TIM1TCTL3.Bits.EDG6A
#define TIM1TCTL3_EDG6B                 _TIM1TCTL3.Bits.EDG6B
#define TIM1TCTL3_EDG7A                 _TIM1TCTL3.Bits.EDG7A
#define TIM1TCTL3_EDG7B                 _TIM1TCTL3.Bits.EDG7B
#define TIM1TCTL3_EDG4x                 _TIM1TCTL3.MergedBits.grpEDG4x
#define TIM1TCTL3_EDG5x                 _TIM1TCTL3.MergedBits.grpEDG5x
#define TIM1TCTL3_EDG6x                 _TIM1TCTL3.MergedBits.grpEDG6x
#define TIM1TCTL3_EDG7x                 _TIM1TCTL3.MergedBits.grpEDG7x

#define TIM1TCTL3_EDG4A_MASK            1U
#define TIM1TCTL3_EDG4B_MASK            2U
#define TIM1TCTL3_EDG5A_MASK            4U
#define TIM1TCTL3_EDG5B_MASK            8U
#define TIM1TCTL3_EDG6A_MASK            16U
#define TIM1TCTL3_EDG6B_MASK            32U
#define TIM1TCTL3_EDG7A_MASK            64U
#define TIM1TCTL3_EDG7B_MASK            128U
#define TIM1TCTL3_EDG4x_MASK            3U
#define TIM1TCTL3_EDG4x_BITNUM          0U
#define TIM1TCTL3_EDG5x_MASK            12U
#define TIM1TCTL3_EDG5x_BITNUM          2U
#define TIM1TCTL3_EDG6x_MASK            48U
#define TIM1TCTL3_EDG6x_BITNUM          4U
#define TIM1TCTL3_EDG7x_MASK            192U
#define TIM1TCTL3_EDG7x_BITNUM          6U


/*** TIM1TCTL4 - Timer Control Register 4; 0x0000040B ***/
typedef union {
  byte Byte;
  struct {
    byte EDG0A       :1;                                       /* Input Capture Edge Control 0A */
    byte EDG0B       :1;                                       /* Input Capture Edge Control 0B */
    byte EDG1A       :1;                                       /* Input Capture Edge Control 1A */
    byte EDG1B       :1;                                       /* Input Capture Edge Control 1B */
    byte EDG2A       :1;                                       /* Input Capture Edge Control 2A */
    byte EDG2B       :1;                                       /* Input Capture Edge Control 2B */
    byte EDG3A       :1;                                       /* Input Capture Edge Control 3A */
    byte EDG3B       :1;                                       /* Input Capture Edge Control 3B */
  } Bits;
  struct {
    byte grpEDG0x :2;
    byte grpEDG1x :2;
    byte grpEDG2x :2;
    byte grpEDG3x :2;
  } MergedBits;
} TIM1TCTL4STR;
