adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
/*** TIM1TC3 - Timer Input Capture/Output Compare Register 3; 0x00000416 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM1TC3Hi - Timer Input Capture/Output Compare Register 3 High (OBSOLETE - defined for backward compatibility); 0x00000416 ***/
    union {
      byte Byte;
      /*** TIM1TC3Hi - Timer Input Capture/Output Compare Register 3 High (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC3Hi                 _TIM1TC3.Overlap_STR.TIM1TC3HiSTR.Byte
      
      /*** TIM1TC3H - Timer Input Capture/Output Compare Register 3 High; Several registers at the same address ***/
      #define TIM1TC3H                  _TIM1TC3.Overlap_STR.TIM1TC3HiSTR.Byte
      
    } TIM1TC3HiSTR;
    

    /*** TIM1TC3Lo - Timer Input Capture/Output Compare Register 3 Low (OBSOLETE - defined for backward compatibility); 0x00000417 ***/
    union {
      byte Byte;
      /*** TIM1TC3Lo - Timer Input Capture/Output Compare Register 3 Low (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC3Lo                 _TIM1TC3.Overlap_STR.TIM1TC3LoSTR.Byte
      
      /*** TIM1TC3L - Timer Input Capture/Output Compare Register 3 Low; Several registers at the same address ***/
      #define TIM1TC3L                  _TIM1TC3.Overlap_STR.TIM1TC3LoSTR.Byte
      
    } TIM1TC3LoSTR;
    
  } Overlap_STR;

} TIM1TC3STR;
extern volatile TIM1TC3STR _TIM1TC3 @0x00000416;
#define TIM1TC3                         _TIM1TC3.Word


/*** TIM1TC4 - Timer Input Capture/Output Compare Register 4; 0x00000418 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM1TC4Hi - Timer Input Capture/Output Compare Register 4 High (OBSOLETE - defined for backward compatibility); 0x00000418 ***/
    union {
      byte Byte;
      /*** TIM1TC4Hi - Timer Input Capture/Output Compare Register 4 High (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC4Hi                 _TIM1TC4.Overlap_STR.TIM1TC4HiSTR.Byte
      
      /*** TIM1TC4H - Timer Input Capture/Output Compare Register 4 High; Several registers at the same address ***/
      #define TIM1TC4H                  _TIM1TC4.Overlap_STR.TIM1TC4HiSTR.Byte
      
    } TIM1TC4HiSTR;
    

    /*** TIM1TC4Lo - Timer Input Capture/Output Compare Register 4 Low (OBSOLETE - defined for backward compatibility); 0x00000419 ***/
    union {
      byte Byte;
      /*** TIM1TC4Lo - Timer Input Capture/Output Compare Register 4 Low (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC4Lo                 _TIM1TC4.Overlap_STR.TIM1TC4LoSTR.Byte
      
      /*** TIM1TC4L - Timer Input Capture/Output Compare Register 4 Low (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC4L                  _TIM1TC4.Overlap_STR.TIM1TC4LoSTR.Byte
      
    } TIM1TC4LoSTR;
    
  } Overlap_STR;

} TIM1TC4STR;
extern volatile TIM1TC4STR _TIM1TC4 @0x00000418;
#define TIM1TC4                         _TIM1TC4.Word


/*** TIM1TC5 - Timer Input Capture/Output Compare Register 5; 0x0000041A ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM1TC5Hi - Timer Input Capture/Output Compare Register 5 High (OBSOLETE - defined for backward compatibility); 0x0000041A ***/
    union {
      byte Byte;
      /*** TIM1TC5Hi - Timer Input Capture/Output Compare Register 5 High (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC5Hi                 _TIM1TC5.Overlap_STR.TIM1TC5HiSTR.Byte
      
      /*** TIM1TC5H - Timer Input Capture/Output Compare Register 5 High; Several registers at the same address ***/
      #define TIM1TC5H                  _TIM1TC5.Overlap_STR.TIM1TC5HiSTR.Byte
      
    } TIM1TC5HiSTR;
    

    /*** TIM1TC5Lo - Timer Input Capture/Output Compare Register 5 Low (OBSOLETE - defined for backward compatibility); 0x0000041B ***/
    union {
      byte Byte;
      /*** TIM1TC5Lo - Timer Input Capture/Output Compare Register 5 Low (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC5Lo                 _TIM1TC5.Overlap_STR.TIM1TC5LoSTR.Byte
      
      /*** TIM1TC5L - Timer Input Capture/Output Compare Register 5 Low; Several registers at the same address ***/
      #define TIM1TC5L                  _TIM1TC5.Overlap_STR.TIM1TC5LoSTR.Byte
      
    } TIM1TC5LoSTR;
    
  } Overlap_STR;

} TIM1TC5STR;
extern volatile TIM1TC5STR _TIM1TC5 @0x0000041A;
#define TIM1TC5                         _TIM1TC5.Word


/*** TIM1TC6 - Timer Input Capture/Output Compare Register 6; 0x0000041C ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM1TC6Hi - Timer Input Capture/Output Compare Register 6 High (OBSOLETE - defined for backward compatibility); 0x0000041C ***/
    union {
      byte Byte;
      /*** TIM1TC6Hi - Timer Input Capture/Output Compare Register 6 High (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC6Hi                 _TIM1TC6.Overlap_STR.TIM1TC6HiSTR.Byte
      
      /*** TIM1TC6H - Timer Input Capture/Output Compare Register 6 High; Several registers at the same address ***/
      #define TIM1TC6H                  _TIM1TC6.Overlap_STR.TIM1TC6HiSTR.Byte
      
    } TIM1TC6HiSTR;
    

    /*** TIM1TC6Lo - Timer Input Capture/Output Compare Register 6 Low (OBSOLETE - defined for backward compatibility); 0x0000041D ***/
    union {
      byte Byte;
      /*** TIM1TC6Lo - Timer Input Capture/Output Compare Register 6 Low (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC6Lo                 _TIM1TC6.Overlap_STR.TIM1TC6LoSTR.Byte
      
      /*** TIM1TC6L - Timer Input Capture/Output Compare Register 6 Low; Several registers at the same address ***/
      #define TIM1TC6L                  _TIM1TC6.Overlap_STR.TIM1TC6LoSTR.Byte
      
    } TIM1TC6LoSTR;
    
  } Overlap_STR;

} TIM1TC6STR;
extern volatile TIM1TC6STR _TIM1TC6 @0x0000041C;
#define TIM1TC6                         _TIM1TC6.Word


