adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
/*** TIM1TC7 - Timer Input Capture/Output Compare Register 7; 0x0000041E ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM1TC7Hi - Timer Input Capture/Output Compare Register 7 High (OBSOLETE - defined for backward compatibility); 0x0000041E ***/
    union {
      byte Byte;
      /*** TIM1TC7Hi - Timer Input Capture/Output Compare Register 7 High (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC7Hi                 _TIM1TC7.Overlap_STR.TIM1TC7HiSTR.Byte
      
      /*** TIM1TC7H - Timer Input Capture/Output Compare Register 7 High; Several registers at the same address ***/
      #define TIM1TC7H                  _TIM1TC7.Overlap_STR.TIM1TC7HiSTR.Byte
      
    } TIM1TC7HiSTR;
    

    /*** TIM1TC7Lo - Timer Input Capture/Output Compare Register 7 Low (OBSOLETE - defined for backward compatibility); 0x0000041F ***/
    union {
      byte Byte;
      /*** TIM1TC7Lo - Timer Input Capture/Output Compare Register 7 Low (OBSOLETE - defined for backward compatibility); Several registers at the same address ***/
      #define TIM1TC7Lo                 _TIM1TC7.Overlap_STR.TIM1TC7LoSTR.Byte
      
      /*** TIM1TC7L - Timer Input Capture/Output Compare Register 7 Low; Several registers at the same address ***/
      #define TIM1TC7L                  _TIM1TC7.Overlap_STR.TIM1TC7LoSTR.Byte
      
    } TIM1TC7LoSTR;
    
  } Overlap_STR;

} TIM1TC7STR;
extern volatile TIM1TC7STR _TIM1TC7 @0x0000041E;
#define TIM1TC7                         _TIM1TC7.Word


/*** TIM1PACTL - 16-Bit Pulse Accumulator A Control Register; 0x00000420 ***/
typedef union {
  byte Byte;
  struct {
    byte PAI         :1;                                       /* Pulse Accumulator Input Interrupt enable */
    byte PAOVI       :1;                                       /* Pulse Accumulator A Overflow Interrupt enable */
    byte CLK0        :1;                                       /* Clock Select Bit 0 */
    byte CLK1        :1;                                       /* Clock Select Bit 1 */
    byte PEDGE       :1;                                       /* Pulse Accumulator Edge Control */
    byte PAMOD       :1;                                       /* Pulse Accumulator Mode */
    byte PAEN        :1;                                       /* Pulse Accumulator A System Enable */
    byte             :1; 
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte grpCLK  :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} TIM1PACTLSTR;
extern volatile TIM1PACTLSTR _TIM1PACTL @0x00000420;
#define TIM1PACTL                       _TIM1PACTL.Byte
#define TIM1PACTL_PAI                   _TIM1PACTL.Bits.PAI
#define TIM1PACTL_PAOVI                 _TIM1PACTL.Bits.PAOVI
#define TIM1PACTL_CLK0                  _TIM1PACTL.Bits.CLK0
#define TIM1PACTL_CLK1                  _TIM1PACTL.Bits.CLK1
#define TIM1PACTL_PEDGE                 _TIM1PACTL.Bits.PEDGE
#define TIM1PACTL_PAMOD                 _TIM1PACTL.Bits.PAMOD
#define TIM1PACTL_PAEN                  _TIM1PACTL.Bits.PAEN
#define TIM1PACTL_CLK                   _TIM1PACTL.MergedBits.grpCLK

#define TIM1PACTL_PAI_MASK              1U
#define TIM1PACTL_PAOVI_MASK            2U
#define TIM1PACTL_CLK0_MASK             4U
#define TIM1PACTL_CLK1_MASK             8U
#define TIM1PACTL_PEDGE_MASK            16U
#define TIM1PACTL_PAMOD_MASK            32U
#define TIM1PACTL_PAEN_MASK             64U
#define TIM1PACTL_CLK_MASK              12U
#define TIM1PACTL_CLK_BITNUM            2U


/*** TIM1PAFLG - Pulse Accumulator A Flag Register; 0x00000421 ***/
typedef union {
  byte Byte;
  struct {
    byte PAIF        :1;                                       /* Pulse Accumulator Input edge interrupt flag */
    byte PAOVF       :1;                                       /* Pulse Accumulator A Overflow interrupt flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} TIM1PAFLGSTR;
extern volatile TIM1PAFLGSTR _TIM1PAFLG @0x00000421;
#define TIM1PAFLG                       _TIM1PAFLG.Byte
#define TIM1PAFLG_PAIF                  _TIM1PAFLG.Bits.PAIF
#define TIM1PAFLG_PAOVF                 _TIM1PAFLG.Bits.PAOVF

#define TIM1PAFLG_PAIF_MASK             1U
#define TIM1PAFLG_PAOVF_MASK            2U


/*** TIM1PACNT - Pulse Accumulators Count Register; 0x00000422 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** TIM1PACNTH - Pulse Accumulators Count Register High; 0x00000422 ***/
    union {
      byte Byte;
    } TIM1PACNTHSTR;
    #define TIM1PACNTH                  _TIM1PACNT.Overlap_STR.TIM1PACNTHSTR.Byte
    

    /*** TIM1PACNTL - Pulse Accumulators Count Register Low; 0x00000423 ***/
    union {
      byte Byte;
    } TIM1PACNTLSTR;
    #define TIM1PACNTL                  _TIM1PACNT.Overlap_STR.TIM1PACNTLSTR.Byte
    
  } Overlap_STR;

} TIM1PACNTSTR;
extern volatile TIM1PACNTSTR _TIM1PACNT @0x00000422;
#define TIM1PACNT                       _TIM1PACNT.Word


/*** TIM1OCPD - Output Compare Pin Disconnect Register; 0x0000042C ***/
typedef union {
  byte Byte;
  struct {
    byte OCPD0       :1;                                       /* Output Compare Pin Disconnect Bit 0 */
    byte OCPD1       :1;                                       /* Output Compare Pin Disconnect Bit 1 */
    byte OCPD2       :1;                                       /* Output Compare Pin Disconnect Bit 2 */
    byte OCPD3       :1;                                       /* Output Compare Pin Disconnect Bit 3 */
    byte OCPD4       :1;                                       /* Output Compare Pin Disconnect Bit 4 */
    byte OCPD5       :1;                                       /* Output Compare Pin Disconnect Bit 5 */
    byte OCPD6       :1;                                       /* Output Compare Pin Disconnect Bit 6 */
    byte OCPD7       :1;                                       /* Output Compare Pin Disconnect Bit 7 */
  } Bits;
} TIM1OCPDSTR;
extern volatile TIM1OCPDSTR _TIM1OCPD @0x0000042C;
#define TIM1OCPD                        _TIM1OCPD.Byte
#define TIM1OCPD_OCPD0                  _TIM1OCPD.Bits.OCPD0
#define TIM1OCPD_OCPD1                  _TIM1OCPD.Bits.OCPD1
#define TIM1OCPD_OCPD2                  _TIM1OCPD.Bits.OCPD2
#define TIM1OCPD_OCPD3                  _TIM1OCPD.Bits.OCPD3
#define TIM1OCPD_OCPD4                  _TIM1OCPD.Bits.OCPD4
#define TIM1OCPD_OCPD5                  _TIM1OCPD.Bits.OCPD5
#define TIM1OCPD_OCPD6                  _TIM1OCPD.Bits.OCPD6
#define TIM1OCPD_OCPD7                  _TIM1OCPD.Bits.OCPD7

#define TIM1OCPD_OCPD0_MASK             1U
#define TIM1OCPD_OCPD1_MASK             2U
#define TIM1OCPD_OCPD2_MASK             4U
#define TIM1OCPD_OCPD3_MASK             8U
#define TIM1OCPD_OCPD4_MASK             16U
#define TIM1OCPD_OCPD5_MASK             32U
#define TIM1OCPD_OCPD6_MASK             64U
#define TIM1OCPD_OCPD7_MASK             128U


/*** TIM1PTPSR - Precision Timer Prescaler Select Register; 0x0000042E ***/
typedef union {
  byte Byte;
  struct {
    byte PTPS0       :1;                                       /* Precision Timer Prescaler Select Bit 0 */
    byte PTPS1       :1;                                       /* Precision Timer Prescaler Select Bit 1 */
    byte PTPS2       :1;                                       /* Precision Timer Prescaler Select Bit 2 */
    byte PTPS3       :1;                                       /* Precision Timer Prescaler Select Bit 3 */
    byte PTPS4       :1;                                       /* Precision Timer Prescaler Select Bit 4 */
    byte PTPS5       :1;                                       /* Precision Timer Prescaler Select Bit 5 */
    byte PTPS6       :1;                                       /* Precision Timer Prescaler Select Bit 6 */
    byte PTPS7       :1;                                       /* Precision Timer Prescaler Select Bit 7 */
  } Bits;
} TIM1PTPSRSTR;
extern volatile TIM1PTPSRSTR _TIM1PTPSR @0x0000042E;
#define TIM1PTPSR                       _TIM1PTPSR.Byte
#define TIM1PTPSR_PTPS0                 _TIM1PTPSR.Bits.PTPS0
#define TIM1PTPSR_PTPS1                 _TIM1PTPSR.Bits.PTPS1
#define TIM1PTPSR_PTPS2                 _TIM1PTPSR.Bits.PTPS2
#define TIM1PTPSR_PTPS3                 _TIM1PTPSR.Bits.PTPS3
#define TIM1PTPSR_PTPS4                 _TIM1PTPSR.Bits.PTPS4
#define TIM1PTPSR_PTPS5                 _TIM1PTPSR.Bits.PTPS5
#define TIM1PTPSR_PTPS6                 _TIM1PTPSR.Bits.PTPS6
#define TIM1PTPSR_PTPS7                 _TIM1PTPSR.Bits.PTPS7

#define TIM1PTPSR_PTPS0_MASK            1U
#define TIM1PTPSR_PTPS1_MASK            2U
#define TIM1PTPSR_PTPS2_MASK            4U
#define TIM1PTPSR_PTPS3_MASK            8U
#define TIM1PTPSR_PTPS4_MASK            16U
#define TIM1PTPSR_PTPS5_MASK            32U
#define TIM1PTPSR_PTPS6_MASK            64U
#define TIM1PTPSR_PTPS7_MASK            128U


