adgenera/jst_nxp_app/SRC/jst_bl/Project_Headers/MC9S12ZVHL32.h
#define LP0IE_LPOCIE_MASK               64U
#define LP0IE_LPDTIE_MASK               128U


/*** LP0IF - LIN Interrupt Flags Register; 0x00000987 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte LPOCIF      :1;                                       /* LIN transmitter over-current interrupt flag */
    byte LPDTIF      :1;                                       /* LIN Transmitter TxD-dominant timeout Interrupt Flag */
  } Bits;
} LP0IFSTR;
extern volatile LP0IFSTR _LP0IF @0x00000987;
#define LP0IF                           _LP0IF.Byte
#define LP0IF_LPOCIF                    _LP0IF.Bits.LPOCIF
#define LP0IF_LPDTIF                    _LP0IF.Bits.LPDTIF

#define LP0IF_LPOCIF_MASK               64U
#define LP0IF_LPDTIF_MASK               128U


/*** LCDCR0 - LCD Control Register 0; 0x00000A00 ***/
typedef union {
  byte Byte;
  struct {
    byte DUTY0       :1;                                       /* LCD Duty Select Bit 0 */
    byte DUTY1       :1;                                       /* LCD Duty Select Bit 1 */
    byte BIAS        :1;                                       /* BIAS Voltage Level Select */
    byte LCLK0       :1;                                       /* LCD Clock Prescaler Bit 0 */
    byte LCLK1       :1;                                       /* LCD Clock Prescaler Bit 1 */
    byte             :1; 
    byte             :1; 
    byte LCDEN       :1;                                       /* LCD32F4BV1 Driver System Enable */
  } Bits;
  struct {
    byte grpDUTY :2;
    byte         :1;
    byte grpLCLK :2;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} LCDCR0STR;
extern volatile LCDCR0STR _LCDCR0 @0x00000A00;
#define LCDCR0                          _LCDCR0.Byte
#define LCDCR0_DUTY0                    _LCDCR0.Bits.DUTY0
#define LCDCR0_DUTY1                    _LCDCR0.Bits.DUTY1
#define LCDCR0_BIAS                     _LCDCR0.Bits.BIAS
#define LCDCR0_LCLK0                    _LCDCR0.Bits.LCLK0
#define LCDCR0_LCLK1                    _LCDCR0.Bits.LCLK1
#define LCDCR0_LCDEN                    _LCDCR0.Bits.LCDEN
/* LCDCR_ARR: Access 2 LCDCRx registers in an array */
#define LCDCR_ARR                       ((volatile byte *) &LCDCR0)
#define LCDCR0_DUTY                     _LCDCR0.MergedBits.grpDUTY
#define LCDCR0_LCLK                     _LCDCR0.MergedBits.grpLCLK

#define LCDCR0_DUTY0_MASK               1U
#define LCDCR0_DUTY1_MASK               2U
#define LCDCR0_BIAS_MASK                4U
#define LCDCR0_LCLK0_MASK               8U
#define LCDCR0_LCLK1_MASK               16U
#define LCDCR0_LCDEN_MASK               128U
#define LCDCR0_DUTY_MASK                3U
#define LCDCR0_DUTY_BITNUM              0U
#define LCDCR0_LCLK_MASK                24U
#define LCDCR0_LCLK_BITNUM              3U


/*** LCDCR1 - LCD Control Register 1; 0x00000A01 ***/
typedef union {
  byte Byte;
  struct {
    byte LCDRSTP     :1;                                       /* LCD Run in Stop Mode */
    byte LCDSWAI     :1;                                       /* LCD Stop in Wait Mode */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
} LCDCR1STR;
extern volatile LCDCR1STR _LCDCR1 @0x00000A01;
#define LCDCR1                          _LCDCR1.Byte
#define LCDCR1_LCDRSTP                  _LCDCR1.Bits.LCDRSTP
#define LCDCR1_LCDSWAI                  _LCDCR1.Bits.LCDSWAI

#define LCDCR1_LCDRSTP_MASK             1U
#define LCDCR1_LCDSWAI_MASK             2U


/*** LCDFPENR0 - LCD Frontplane Enable Register 0; 0x00000A02 ***/
typedef union {
  byte Byte;
  struct {
    byte FP0EN       :1;                                       /* Frontplane Output Enable Bit 0 */
    byte FP1EN       :1;                                       /* Frontplane Output Enable Bit 1 */
    byte FP2EN       :1;                                       /* Frontplane Output Enable Bit 2 */
    byte FP3EN       :1;                                       /* Frontplane Output Enable Bit 3 */
    byte FP4EN       :1;                                       /* Frontplane Output Enable Bit 4 */
    byte FP5EN       :1;                                       /* Frontplane Output Enable Bit 5 */
    byte FP6EN       :1;                                       /* Frontplane Output Enable Bit 6 */
    byte FP7EN       :1;                                       /* Frontplane Output Enable Bit 7 */
  } Bits;
} LCDFPENR0STR;
extern volatile LCDFPENR0STR _LCDFPENR0 @0x00000A02;
#define LCDFPENR0                       _LCDFPENR0.Byte
#define LCDFPENR0_FP0EN                 _LCDFPENR0.Bits.FP0EN
#define LCDFPENR0_FP1EN                 _LCDFPENR0.Bits.FP1EN
#define LCDFPENR0_FP2EN                 _LCDFPENR0.Bits.FP2EN
#define LCDFPENR0_FP3EN                 _LCDFPENR0.Bits.FP3EN
#define LCDFPENR0_FP4EN                 _LCDFPENR0.Bits.FP4EN
#define LCDFPENR0_FP5EN                 _LCDFPENR0.Bits.FP5EN
#define LCDFPENR0_FP6EN                 _LCDFPENR0.Bits.FP6EN
#define LCDFPENR0_FP7EN                 _LCDFPENR0.Bits.FP7EN
/* LCDFPENR_ARR: Access 5 LCDFPENRx registers in an array */
#define LCDFPENR_ARR                    ((volatile byte *) &LCDFPENR0)

#define LCDFPENR0_FP0EN_MASK            1U
#define LCDFPENR0_FP1EN_MASK            2U
#define LCDFPENR0_FP2EN_MASK            4U
#define LCDFPENR0_FP3EN_MASK            8U
#define LCDFPENR0_FP4EN_MASK            16U
#define LCDFPENR0_FP5EN_MASK            32U
#define LCDFPENR0_FP6EN_MASK            64U
#define LCDFPENR0_FP7EN_MASK            128U


/*** LCDFPENR1 - LCD Frontplane Enable Register 1; 0x00000A03 ***/
typedef union {
  byte Byte;
  struct {
    byte FP8EN       :1;                                       /* Frontplane Output Enable Bit 8 */
    byte FP9EN       :1;                                       /* Frontplane Output Enable Bit 9 */
    byte FP10EN      :1;                                       /* Frontplane Output Enable Bit 10 */
    byte FP11EN      :1;                                       /* Frontplane Output Enable Bit 11 */
    byte FP12EN      :1;                                       /* Frontplane Output Enable Bit 12 */
    byte FP13EN      :1;                                       /* Frontplane Output Enable Bit 13 */
    byte FP14EN      :1;                                       /* Frontplane Output Enable Bit 14 */
    byte FP15EN      :1;                                       /* Frontplane Output Enable Bit 15 */
  } Bits;
} LCDFPENR1STR;
